       IDENTIFICATION DIVISION.
       PROGRAM-ID.EXCBL01.
      ******************************************************************
      * AUTOR: JULIO VILELA
      * OBJETIVO: 1º CONTATO COM COBOL
      * DATA: 11/10/2022
      * OBSERVAÇÕES:
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello world"
           DISPLAY "JULIO VILELA"
           STOP RUN.
       END PROGRAM EXCBL01.
